Repository: pingfangx/TranslatorX-other
Catalog: JavaTutorial/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: (An important exception: final fields, which cannot be modified after the object is constructed, can be safely read through non-synchronized methods, once the object is constructed) This strategy is effective, but can present problems with liveness, as we'll see later in this lesson.
zh_cn: （一个重要的例外是：final 字段，它在对象创建完成后是不能被修改的，因此，一旦对象创建完毕，就可以通过非同步的方法对其进行安全的读取）。这种策略是有效的，但是可能导致 活跃度（liveness）问题。这点我们会在本课程的后面进行描述。

source: (Invoking other objects' methods from synchronized code can create problems that are described in the section on Liveness.) Without synchronized statements, there would have to be a separate, unsynchronized method for the sole purpose of invoking nameList.add.
zh_cn: （在同步代码中调用其他对象的方法可能导致问题，将在Liveness部分描述。）如果没有使用同步语名块，那么将不得不使用一个单独的，未同步的方法来完成对nameList.add的调用。

source: (The API specification often refers to this entity simply as a "monitor.") Intrinsic locks play a role in both aspects of synchronization: enforcing exclusive access to an object's state and establishing happens-before relationships that are essential to visibility.
zh_cn: （API 规范通常将此实体简称为“监视器（monitor）”。）内部锁在同步的两个方面发挥作用：强制对对象状态的独占（独占，排他，exclusive）访问，并建立对对象可见性至关重要的happens-before关系。

source: (We'll describe worker threads in the section on Thread Pools.)
zh_cn: （我们将在线程池一节中描述工作线程。）

source: BlockingQueue defines a first-in-first-out data structure that blocks or times out when you attempt to add to a full queue, or retrieve from an empty queue.
zh_cn: BlockingQueue定义了一个先进先出的数据结构，当你尝试往满队列中添加元素，或者从空队列中获取元素时，将会阻塞或者超时。

source: ConcurrentMap is a subinterface of java.util.Map that defines useful atomic operations.
zh_cn: ConcurrentMap 是 java.util.Map 的子接口，定义了一些有用的原子操作。

source: ConcurrentNavigableMap is a subinterface of ConcurrentMap that supports approximate matches.
zh_cn: ConcurrentNavigableMap 是 ConcurrentMap 的子接口，支持近似匹配。

source: SimpleThreads consists of two threads.
zh_cn: SimpleThreads 由两个线程组成。

source: ThreadLocalRandom (in JDK 7) provides efficient generation of pseudorandom numbers from multiple threads.
zh_cn: 并发随机数（ThreadLocalRandom） (in JDK 7) 提供了高效的多线程生成伪随机数的方法

source: Atomic Access talks about the general idea of operations that can't be interfered with by other threads.
zh_cn: 原子访问（Atomic Access）谈到不受其他线程干扰的操作的一般思路。

source: Atomic variables have features that minimize synchronization and help avoid memory consistency errors.
zh_cn: 原子变量 具有最小化同步并有助于避免内存一致性错误的功能。

source: Concurrent collections make it easier to manage large collections of data, and can greatly reduce the need for synchronization.
zh_cn: 并发集合 并发集合简化了大型数据集合管理，且极大的减少了同步的需求。

source: Executor Interfaces define the three executor object types.
zh_cn: 执行器接口 定义三个执行器对象类型。

source: Executors define a high-level API for launching and managing threads.
zh_cn: 执行器（Executors） 定义一个用于启动和管理线程的高级API。

source: Fork/Join is a framework (new in JDK 7) for taking advantage of multiple processors.
zh_cn: Fork/Join 是一个框架（JDK 7中新添加），目的是为了帮助你更好地利用多处理器带来的好处。

source: Home Page > Essential Classes
zh_cn: 首页 > 基本类

source: Home Page > Essential Classes > Concurrency
zh_cn: 主页 > 基本类 > 并发

source: Implicit Locks and Synchronization describes a more general synchronization idiom, and describes how synchronization is based on implicit locks.
zh_cn: 隐式锁（内部锁：intrinsic ）和同步（Implicit Locks and Synchronization）描述了一个更一般的同步做法，并描述了如何基于隐式锁的同步。

source: Lock objects support locking idioms that simplify many concurrent applications.
zh_cn: 锁对象 提供了可以简化许多并发应用的锁的用法。

source: Memory Consistency Errors describes errors that result from inconsistent views of shared memory.
zh_cn: 内存一致性错误（Memory Consistency Errors）描述由于共享内存视图不一致而导致的错误。

source: Synchronized Methods describes a simple idiom that can effectively prevent thread interference and memory consistency errors.
zh_cn: 同步方法（Synchronized Methods）描述了一种简单的做法，可以有效防止线程干扰和内存一致性错误。

source: Thread Interference describes how errors are introduced when multiple threads access shared data.
zh_cn: 线程干扰（Thread Interferenc）描述了多线程访问共享数据时如何引入错误。

source: Thread Pools are the most common kind of executor implementation.
zh_cn: 线程池 线程池是最常见的一种执行器的实现。

source: Your use of this page and all the material on pages under "The Java Tutorials" banner is subject to these legal notices.
zh_cn: 您使用这个页面及 "The Java Tutorials"banner下的所有村料都受这些法律申明所约束。

source: « Previous • Trail • Next »
zh_cn: « 前 • Trail • 后 »

source: Starvation and livelock are forms of thread contention.
zh_cn: 饥饿（Starvation）和活锁 （livelock） 是线程竞争的表现形式。

source: Trail: Essential Classes
zh_cn: Trail:基本类

source: Counter is designed so that each invocation of increment will add 1 to c, and each invocation of decrement will subtract 1 from c.
zh_cn: Counter 被设计为每次调用 increment 将对 c加1 ，每次调用 decrement 将会对c减1。

source: Executor, a simple interface that supports launching new tasks.
zh_cn: Executor，一个运行新任务的简单接口。

source: ExecutorService also provides methods for submitting large collections of Callable objects.
zh_cn: ExecutorService 也提供了批量运行 Callable 对象的方法。

source: ExecutorService, a subinterface of Executor, which adds features that help manage the lifecycle, both of the individual tasks and of the executor itself.
zh_cn: ExecutorService扩展自Executor，添加了一些用来管理执行器生命周期和任务生命周期的方法。

source: Lock objects work very much like the implicit locks used by synchronized code.
zh_cn: Lock 对象作用非常类似同步代码使用的内部锁（implicit lock）。

source: ScheduledExecutorService, a subinterface of ExecutorService, supports future and/or periodic execution of tasks.
zh_cn: ScheduledExecutorService扩展自ExecutorService，支持 future 和（或）定期执行任务。

source: SynchronizedRGB must be used carefully to avoid being seen in an inconsistent state.
zh_cn: SynchronizedRGB 使用时必须小心，避免其处于不一致的状态。

source: Thread.sleep causes the current thread to suspend execution for a specified period.
zh_cn: Thread.sleep 可以让当前线程执行暂停一个时间段

source: Lock objects also support a wait/notify mechanism, through their associated Condition objects.
zh_cn: 通过关联的Condition 对象，Lock对象也支持wait/notify 机制。

source: ForkJoinPool implements the core work-stealing algorithm and can execute ForkJoinTask processes.
zh_cn: ForkJoinPool 实现了核心工作窃取算法，可以执行 ForkJoinTask 任务。

source: Provide a Runnable object. The Runnable interface defines a single method, run, meant to contain the code executed in the thread.
zh_cn: 提供一个 Runnable 对象。 Runnable 接口定义了一个简单的方法 run，意味着包含线程中要执行的代码。

source: Subclass Thread. The Thread class itself implements Runnable, though its run method does nothing.
zh_cn: Thread的子类。 Thread 类本身实现了Runnable接口，尽管它的run 方法没做任何操作。

source: Java Concurrent Animated: Animations that show usage of concurrency features.
zh_cn: Java并发动画：显示并发功能使用的动画。

source: Deadlock describes a situation where two or more threads are blocked forever, waiting for each other.
zh_cn: 死锁 是指两个或两个以上的线程永远被阻塞，一直等待对方的资源的情况。

source: Memory consistency errors occur when different threads have inconsistent views of what should be the same data.
zh_cn: 内存一致性错误发生在不同的线程对本该是相同数据的view不一致时。

source: Starvation describes a situation where a thread is unable to gain regular access to shared resources and is unable to make progress.
zh_cn: 饥饿描述了这样一种情况：一个线程无法获得对共享资源的定期访问，无法继续执行。

source: Note: Always invoke wait inside a loop that tests for the condition being waited for.
zh_cn: 注意： 始终在一个检查正在等特的条件的循环内调用 wait 方法。

source: Note: The Drop class was written in order to demonstrate guarded blocks.
zh_cn: 注意： Drop 类是为了演示保护块而编写的。

source: Note: There is a second notification method, notify, which wakes up a single thread.
zh_cn: 注意： 还有第二个通式方法——notify，它只会唤醒一个线程。

source: Warning: When constructing an object that will be shared between threads, be very careful that a reference to the object does not "leak" prematurely.
zh_cn: 警告： 在创建多个线程共享的对象时，要特别小心对该对象的引用不能过早地“泄露”。

source: A Java application can create additional processes using a ProcessBuilder object.
zh_cn: Java 应用程序可以使用ProcessBuilder 对象创建额外的进程。

source: A Strategy for Defining Immutable Objects
zh_cn: 定义不可变对象的策略

source: A Synchronized Class Example
zh_cn: 一个同步类的例子

source: A comprehensive work by a leading expert, who's also the architect of the Java platform's concurrency framework.
zh_cn: 领先专家的全面工作，他也是Java平台并发框架的架构师。

source: A computer system normally has many active processes and threads.
zh_cn: 一个计算机系统通常有许多活动的进程和线程。

source: A concurrent application's ability to execute in a timely manner is known as its liveness.
zh_cn: 一个发行应用程序及时执行的能力被称为其 活跃度（liveness）。

source: A more efficient guard invokes Object.wait to suspend the current thread.
zh_cn: 更高效的保护方法是调用Object.wait 来挂起当前线程。

source: A more sophisticated approach is to make the constructor private and construct instances in factory methods.
zh_cn: 更好的方法是将构造函数声明为 private，通过工厂方法创建对象。

source: A practical guide designed to be accessible to the novice.
zh_cn: 一个实用的指南，旨在为新手提供。

source: A process generally has a complete, private set of basic run-time resources; in particular, each process has its own memory space.
zh_cn: 程通常有一个完整的、私人的基本运行时资源;特别是,每个进程都有其自己的内存空间。

source: A process has a self-contained execution environment.
zh_cn: 进程有一个独立的执行环境。

source: A simple array length threshold helps determine whether the work is performed or split.
zh_cn: 数组的长度可以作为一个简单的阀值来判断任务是应该直接完成还是应该被拆分。

source: A simple way to create an executor that uses a fixed thread pool is to invoke the newFixedThreadPool factory method in java.util.concurrent.Executors This class also provides the following factory methods:
zh_cn: 创建一个使用固定大小的线程池的执行器的方法是调用 java.util.concurrent.Executors的newFixedThreadPool 工厂方法。该类还提供以下一些工厂方法：

source: A strict rule of courtesy is that when you bow to a friend, you must remain bowed until your friend has a chance to return the bow.
zh_cn: 礼貌的一个严格的规则是，当你给一个朋友鞠躬时，你必须保持鞠躬，直到你的朋友鞠躬回给你。

source: A thread is said to own the intrinsic lock between the time it has acquired the lock and released the lock.
zh_cn: 在线程获取对象的内部锁到释放对象的内部锁的这段时间，我们说该线程占有该对象的内部锁。

source: A thread often acts in response to the action of another thread.
zh_cn: 线程通常会响应于另一个线程的动作。

source: A thread sends an interrupt by invoking interrupt on the Thread object for the thread to be interrupted.
zh_cn: 线程通过调用Thread 对象的interrupt 方法来发出中断，以使线程中断。

source: After these changes, we have ImmutableRGB:
zh_cn: 经过以上这些修改后，我们得到了ImmutableRGB：

source: After your ForkJoinTask subclass is ready, create the object that represents all the work to be done and pass it to the invoke() method of a ForkJoinPool instance.
zh_cn: 当你的 ForkJoinTask 子类准备好以后，创建一个代表所有需要完成工作的对象，然后将其作为参数传递给一个ForkJoinPool 实例的 invoke() 方法。

source: All classes have get and set methods that work like reads and writes on volatile variables.
zh_cn: 所有的类都提供了 get 和 set</c3方法，可以使用它们像读写 volatile 变量一样读写原子类。

source: All fields are already private; they are further qualified as final.
zh_cn: 所有字段已经是 private ; 它们被进一步限定为 final 。

source: All of these collections help avoid Memory Consistency Errors by defining a happens-before relationship between an operation that adds an object to the collection with subsequent operations that access or remove that object.
zh_cn: 所有这些集合，通过在集合里新增对象和访问或移除对象的操作之间，定义一个happens-before 的关系，来帮助程序员避免内存一致性错误。

source: All that is needed is a strategy for avoiding them.
zh_cn: 我们需要的是一种可以避免这种错误的方法。

source: All updates of these fields must be synchronized, but there's no reason to prevent an update of c1 from being interleaved with an update of c2  and doing so reduces concurrency by creating unnecessary blocking.
zh_cn: 所有对这两个变量的更新都需要进行同步。但是没有理由阻止对 c1 的更新和对 c2 的更新出现交错——这样做会创建不必要的阻塞，进而降低并发性。

source: All you need to do is call ThreadLocalRandom.current(), then call one of its methods to retrieve a random number.
zh_cn: 你只需调用 ThreadLocalRandom.current()， 然后调用它的其中一个方法去获取一个随机数即可。

source: Allowing a thread to acquire the same lock more than once enables reentrant synchronization.
zh_cn: 允许一个线程能重复获得同一个锁就使得重入同步（reentrant synchronization）。

source: Alphonse and Gaston are friends, and great believers in courtesy.
zh_cn: Alphonse 和 Gaston 是朋友,都很有礼貌。

source: Alphonse and Gaston have trained themselves to notice when a friend is about to bow.
zh_cn: Alphonse 和 Gaston 已经把自己训练成能注意到朋友何时要鞠躬。

source: Also, the sleep period can be terminated by interrupts, as we'll see in a later section.
zh_cn: 此外，休眠期可以通过中断终止，我们将在后面的部分中看到。

source: An interrupt is an indication to a thread that it should stop what it is doing and do something else.
zh_cn: interrupt 是一个线程的指示，告诉它应该停止它正在做的事，去做别的事情。

source: An application can subclass Thread, providing its own implementation of run, as in the HelloThread example:
zh_cn: 就用可以继承Thread，提供自己的 run实现，如 HelloThread 所示：

source: An application that creates an instance of Thread must provide the code that will run in that thread.
zh_cn: 创建Thread的实例的应用程序必须提供将在该线程中运行的代码。

source: An atomic action cannot stop in the middle: it either happens completely, or it doesn't happen at all.
zh_cn: 原子性动作是不能在中间停止的：要么一次性完全执行完毕，要么就不执行。

source: An important advantage of the fixed thread pool is that applications using it degrade gracefully.
zh_cn: 使用固定大小的线程池一个很重要的好处是可以实现 优雅退化（degrade gracefully）。

source: An introduction to concurrent programming through a combination of modeling and practical examples.
zh_cn: 通过建模和实例的组合介绍并发编程。

source: An object is considered immutable if its state cannot change after it is constructed.
zh_cn: 如果一个对象被构造后，状态不能改变，则这个对象被认为是不可变的（immutable）。

source: Another implementation of the fork/join framework is used by methods in the java.util.streams package, which is part of Project Lambda scheduled for the Java SE 8 release.
zh_cn: 其他采用了 fork/join 框架的方法还包括 java.util.streams 包，此包是作为 java se 8 发行版中 Project Lambda 中的一部分。

source: Another way to create synchronized code is with synchronized statements.
zh_cn: 另外一种创建同步代码的方式就是使用 同步语名块（synchronized statements）。

source: Applying this strategy to SynchronizedRGB results in the following steps:
zh_cn: 将这一策略应用到SynchronizedRGB 有以下几步：

source: As long as a thread owns an intrinsic lock, no other thread can acquire the same lock.
zh_cn: 只要有一个线程已经拥有了一个内部锁，其他线程就不能再拥有该锁了。

source: As with any ExecutorService implementation, the fork/join framework distributes tasks to worker threads in a thread pool.
zh_cn: 与任何 ExecutorService 实现一样，fork/join框架将任务分配给线程池中的工作线程。

source: As with deadlock, livelocked threads are unable to make further progress.
zh_cn: 与死锁一样，活锁后线程也无法进一步运行。

source: As with implicit locks, only one thread can own a Lock object at a time.
zh_cn: 如同内部锁，每次只有一个线程可以获得 Lock 。

source: At some future time, another thread will acquire the same lock and invoke Object.notifyAll, informing all threads waiting on that lock that something important has happened:
zh_cn: 然后另一个线程请求该锁并调用 Object.notifyAll，通知所有等待该锁的线程有重要的事情已经发生了。

source: Atomic Access
zh_cn: 原子访问

source: Atomic Variables
zh_cn: 原子变量

source: Atomic actions cannot be interleaved, so they can be used without fear of thread interference.
zh_cn: 原子性动作是不会出现交错的，因此，使用这些原子性动作时不用考虑线程间的干扰。

source: Basic Use
zh_cn: 基本使用方法

source: Because notify doesn't allow you to specify the thread that is woken up, it is useful only in massively parallel applications  that is, programs with a large number of threads, all doing similar chores.
zh_cn: 因为notify不允许你指定被唤醒的线程，它只在大规模并行应用程序中有用？ 也就是说，有大量线程的程序，都做类似的事情。

source: Because they are unpredictable, thread interference bugs can be difficult to detect and fix.
zh_cn: 由于这种“交错”是不可预测的，线程间相互干扰造成的 bug 是很难定位和修改的。

source: Besides using the fork/join framework to implement custom algorithms for tasks to be performed concurrently on a multiprocessor system (such as the ForkBlur.java example in the previous section), there are some generally useful features in Java SE which are already implemented using the fork/join framework.
zh_cn: 除了能够使用 fork/join 框架来实现能够在多处理系统中被并行执行的定制化算法（如前文中的 ForkBlur.java例子），在 java SE 中一些比较常用的功能点也已经使用 fork/join 框架来实现了。

source: Blurring for Clarity
zh_cn: 模糊图片的例子

source: Both processes and threads provide an execution environment, but creating a new thread requires fewer resources than creating a new process.
zh_cn: 进程和线程都提供一个执行环境,但创建一个新的线程比创建一个新的进程需要更少的资源。

source: But a thread can acquire a lock that it already owns.
zh_cn: 介是线程 可以 获得自身已经拥有的锁。

source: But for a more complicated class, we might want to avoid the liveness impact of unnecessary synchronization.
zh_cn: 但是对于更复杂的类，我们可能想要避免不必要同步所带来的活跃度影响。

source: But from the application programmer's point of view, you start with just one thread, called the main thread.
zh_cn: 但从程序员的角度来看,你启动只有一个线程，称为主线程（ main thread）。

source: But if the two statements are executed in separate threads, the value printed out might well be "0", because there's no guarantee that thread A's change to counter will be visible to thread B  unless the programmer has established a happens-before relationship between these two statements.
zh_cn: 但是如果这两条语句是在两个不同的线程中，那么输出的结构有可能是0。这是因为没有保证线程 A 对 counter 的修改对线程 B 来说是可见的。除非程序员在这两条语句间建立了一定的 happens-before 关系。

source: But then other threads can use instances to access the object before construction of the object is complete.
zh_cn: 但是，其他线程可会在该对象的构造完成之前就使用 instances 访问该对象。

source: By convention, a thread that needs exclusive and consistent access to an object's fields has to acquire the object's intrinsic lock before accessing them, and then release the intrinsic lock when it's done with them.
zh_cn: 按照惯例，如果一个线程需要对一个对象的字段进行排他性访问并保持访问时，必须在访问前获取对象的内部锁， 最后 释放 内部锁。

source: By convention, any method that exits by throwing an InterruptedException clears interrupt status when it does so.
zh_cn: 按照惯例，任何方法因抛出一个 InterruptedException退出都会清除中断状态。

source: Can you pass a Thread object to Executor.execute?
zh_cn: 你可以将线程对象传递给 Executor.execute 吗？

source: Check your answers.
zh_cn: 检查你的答案。

source: Compile and run BadThreads.java:
zh_cn: 编译并运行 BadThreads.java：

source: Computer users take it for granted that their systems can do more than one thing at a time.
zh_cn: 参考：_waylau.[ Java 编程要点之并发（Concurrency）详解](http://blog.csdn.net/kkkloveyou/article/details/50561269).计算机用户认为他们的系统一次可以做一件以上的事情。

source: Concurrency
zh_cn: 并发

source: Concurrent Collections
zh_cn: 并发集合

source: Concurrent Random Numbers
zh_cn: 并发随机数

source: Consider a simple class called Counter
zh_cn: 考虑下面的一个简单的类Counter

source: Coordination is essential: the consumer thread must not attempt to retrieve the data before the producer thread has delivered it, and the producer thread must not attempt to deliver new data if the consumer hasn't retrieved the old data.
zh_cn: 协调是至关重要的：消费者线程不得在生产者线程传递之前尝试检索数据，如果消费者没有检索到旧数据，生产者线程不得尝试传递新数据。

source: Create a task that represents all of the work to be done.
zh_cn: 创建一个表示所有需要完成工作的任务。

source: Create the ForkJoinPool that will run the task.
zh_cn: 创建将要用来执行任务的 ForkJoinPool 。

source: Deadlock
zh_cn: 死锁（Deadlock）

source: Defining and Starting a Thread
zh_cn: 定义和启动一个线程

source: Depending on the Executor implementation, execute may do the same thing, but is more likely to use an existing worker thread to run r, or to place r in a queue to wait for a worker thread to become available.
zh_cn: 根据Executor 的实现， execute 可以完成同样的事，但更可能使用一个已存在的工作线程来执行r，或者把 r 放到队列中等待可用的工作线程。

source: Documentation
zh_cn: 文档

source: Don't allow subclasses to override methods.
zh_cn: 不要允许子类重写方法

source: Don't assume that the interrupt was for the particular condition you were waiting for, or that the condition is still true.
zh_cn: 不要假设中断是针对您正在等待的特定条件，或者假设该条件仍然为真。

source: Don't provide "setter" methods  methods that modify fields or objects referred to by fields.
zh_cn: 不要提供"setter"方法——即修改字段引用的字段或对象的方法。

source: Don't provide methods that modify the mutable objects.
zh_cn: 不提供修改可变对象的方法。

source: Don't share references to the mutable objects.
zh_cn: 不共享可变对象的引用。

source: Each object represents the color as three integers that stand for primary color values and a string that gives the name of the color.
zh_cn: 每一个对象代表一种颜色，使用三个整形数表示颜色的三基色，用一个字符串表示颜色名称。

source: Each pixel is averaged with its surrounding pixels (the red, green, and blue components are averaged), and the result is placed in the destination array.
zh_cn: 每个像素与其周围的像素（红色，绿色和蓝色分量被平均）进行平均，并将结果放在目标数组中。

source: Each thread is associated with an instance of the class Thread.
zh_cn: 每个线程都与 Thread类的一个实例相关联。

source: Even a single application is often expected to do more than one thing at a time.
zh_cn: 即使是单一的应用程序通常也被期望同时做多件事情。

source: Even the word processor should always be ready to respond to keyboard and mouse events, no matter how busy it is reformatting text or updating the display.
zh_cn: 即使文字处理器也应该随时准备好响应键盘和鼠标事件，无论重新格式化文本或更新显示器多么忙碌。

source: Even very simple expressions can define complex actions that can decompose into other actions.
zh_cn: 即使是非常简单的表达式也包含了复杂的动作，这些动作可以被解释成许多别的动作。

source: Every application has at least one thread  or several, if you count "system" threads that do things like memory management and signal handling.
zh_cn: 每个应用程序都至少有一个线程,或者几个,如果算上“系统”的线程（负责内存管理和信号处理）那就更多。

source: Every object has an intrinsic lock associated with it.
zh_cn: 每一个对象都有一个与之相关联动的内部锁。

source: Executor Interfaces
zh_cn: 执行器接口

source: Executor implementations provided by java.util.concurrent provide thread pool management suitable for large-scale applications.
zh_cn: Executor 的实现由 java.util.concurrent 包提供，提供了适合大规模应用的线程池管理。

source: Executors
zh_cn: 执行器（Executors）

source: Executors are discussed with other high-level concurrency objects.
zh_cn: Executors在另外的 高级并发对象中讨论

source: Exercises
zh_cn: 练习

source: Finally, ExecutorService provides a number of methods for managing the shutdown of the executor.
zh_cn: 最后， ExecutorService 还提供了一些关闭执行器的方法。

source: Finally, here is the main thread, defined in ProducerConsumerExample, that launches the producer and consumer threads.
zh_cn: 最后ProducerConsumerExample中定义主线程，它启动生产者和消费者线程。

source: First, it is not possible for two invocations of synchronized methods on the same object to interleave.
zh_cn: 首先，不可能出现对同一对象的同步方法的两个调用的“交错”。

source: For Further Reading
zh_cn: 扩展阅读

source: For a list of actions that create happens-before relationships, refer to the Summary page of the java.util.concurrent package..
zh_cn: 关于哪些操作可以建立这种 happens-before，更多的信息请参阅java.util.concurrent 包的概要说明。

source: For concurrent access, using ThreadLocalRandom instead of Math.random() results in less contention and, ultimately, better performance.
zh_cn: 对于并发访问，使用 ThreadLocalRandom 代替 Math.random() 可以减少竞争，从而获得更好的性能。

source: For example, suppose an object provides a synchronized method that often takes a long time to return.
zh_cn: 例如，假设一个对象提供一个同步的方法，往往需要很长时间返回。

source: For example, suppose the central message loop in the SleepMessages example were in the run method of a thread's Runnable object.
zh_cn: 例如，SleepMessages 示例在线程的 Runnable 对象中的 run方法中支持消息循环。

source: For example, suppose you want to maintain a List called instances containing every instance of class.
zh_cn: 例如，假定你想要维护一个保存所有类的实例的列表 ： instances。

source: For example, that streaming audio application must simultaneously read the digital audio off the network, decompress it, manage playback, and update its display.
zh_cn: 例如，流式音频应用程序必须同时从网络读取数字音频，解压缩，管理播放以及更新其显示。

source: For example:
zh_cn: 例如：

source: For more information, refer to the Questions and Exercises section.
zh_cn: 更多信息，参见：Questions and Exercises 部分。

source: For more information, see the Lambda Expressions section.
zh_cn: 想要了解更多信息，请参见 Lambda Expressions一节。

source: For the full source code, including some extra code that creates the destination image file, see the ForkBlur example.
zh_cn: 想要浏览完成的源代码，请查看 ForkBlur 示例，其中还包含一些创建 destination 图片文件的额外代码。

source: For the interrupt mechanism to work correctly, the interrupted thread must support its own interruption.
zh_cn: 为了中断机制能正常工作，被中断的线程必须支持自己的中断。

source: For this information, see the Java API documentation.
zh_cn: 想要了解更多的信息，请参见 Java API 文档。

source: For this simple class, synchronization is an acceptable solution.
zh_cn: 对于这个简单的类，同步是一种可接受的解决方案。

source: Fortunately, the programmer does not need a detailed understanding of these causes.
zh_cn: 幸运的是，编程人员不需要详细了解这些原因。

source: Guarded Blocks
zh_cn: 保护块（Guarded Blocks）
